isKeyMappingEnabled := true

^#Up::
isKeyMappingEnabled := !isKeyMappingEnabled
status := (isKeyMappingEnabled ? "US" : "JIS")
MsgBox, status
return

 ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
 ; 1’i–Ú
 ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
 #If isKeyMappingEnabled
 +2::Send,{!}       ; Shift + 2         ["] -> @
 +1::Send,{@}       ; Shift + 2         ["] -> @
 +6::Send,{&}       ; Shift + 6         [&] -> ^
 +7::Send,{^}       ; Shift + 7         ['] -> &
 ^::Send,{+}       ;                   [^] -> =
 +^::Send,{*}       ; Shift + ^         [~] -> +

 ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
 ; 2’i–Ú
 ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
 @::[              ;                   [@] -> [
 +@::{             ; Shift + @         [`] -> {
 [::]              ;                   [[] -> ]
 +[::Send,{}}      ; Shift + [         [{] -> }

 ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
 ; 3’i–Ú
 ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
 +;::Send,{:}      ; Shift + ;         [+] -> :
 :::Send,{'}       ;                   [:] -> '
 *::Send,{"}       ; Shift + :         [*] -> "
 +]::Send,{~}      ; Shift + ]         [}] -> ~
 ]::Send,{``}      ;                   []] -> `
